Revit 2024 API
TemperatureRatingType.WireSizes Property
 Get all electrical wire sizes defined in this temperature rating type and its corresponding material type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireSizeSet WireSizes { get; }
Visual Basic
Public ReadOnly Property WireSizes As WireSizeSet
	Get
Visual C++
public:
property WireSizeSet^ WireSizes {
	WireSizeSet^ get ();
}
See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace